Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotCursorEventData_t
The Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotCursorEventData_t struct represents the cursor event data.

Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotCursorEventData_t.ObjectsArraySize
The constant size of the Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotCursorEventData_t.Objects array.

Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotCursorEventData_t.HandleId
The identifier of the handle object.

Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotCursorEventData_t.CameraData
The camera and view data of the event.

Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotCursorEventData_t.Modifiers
The event modifiers.

Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotCursorEventData_t.ObjectsCount
The number of tolerated objects.

Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotCursorEventData_t.Objects
The array containing tolerated objects.